<?php
/**
 *
 * Program_Name        :  案件独自の初期設定
 * File_Name           :  OrgInitialExtendsClass.php
 * Producter           :  nakamoto
 * Programming_Date    :  2013/04/20
 * Comment             :  
 * History:
 * Date           Name               Title
 * 2013/04/20     nakamoto           new
 *
*/

class OrgInitialExtends {

/**-----------------------------------------------
 * Function_Name       :  OrgInitialExtends()
 * Title               :  コンストラクタ
 * Parameter           :
 * return value        :
 * Comment             :
*/
	function OrgInitialExtends() {
	}
	//function __construct() {
	//	$this->OrgInitialExtends();
	//}

/**-----------------------------------------------
 * Function_Name       :  getMaster()
 * Title               :  マスタ情報の設定
 * Parameter           :  マスターコード、キー、オプション値
 * return value        :  配列　※キーがあればキーの値
 * Comment             :  例）getMaster(48,'','300-399');
*/
	function getMaster($code='', $key='', $op='') {
		if ($code == '') { return; }
		unset($arr);
		switch ($code) {
			case 1:
				// 都道府県
				$arr = array(
					'1' =>		'北海道',
					'2' =>		'青森県',
					'3' =>		'岩手県',
					'4' =>		'宮城県',
					'5' =>		'秋田県',
					'6' =>		'山形県',
					'7' =>		'福島県',
					'8' =>		'茨城県',
					'9' =>		'栃木県',
					'10' =>		'群馬県',
					'11' =>		'埼玉県',
					'12' =>		'千葉県',
					'13' =>		'東京都',
					'14' =>		'神奈川県',
					'15' =>		'新潟県',
					'16' =>		'富山県',
					'17' =>		'石川県',
					'18' =>		'福井県',
					'19' =>		'山梨県',
					'20' =>		'長野県',
					'21' =>		'岐阜県',
					'22' =>		'静岡県',
					'23' =>		'愛知県',
					'24' =>		'三重県',
					'25' =>		'滋賀県',
					'26' =>		'京都府',
					'27' =>		'大阪府',
					'28' =>		'兵庫県',
					'29' =>		'奈良県',
					'30' =>		'和歌山県',
					'31' =>		'鳥取県',
					'32' =>		'島根県',
					'33' =>		'岡山県',
					'34' =>		'広島県',
					'35' =>		'山口県',
					'36' =>		'徳島県',
					'37' =>		'香川県',
					'38' =>		'愛媛県',
					'39' =>		'高知県',
					'40' =>		'福岡県',
					'41' =>		'佐賀県',
					'42' =>		'長崎県',
					'43' =>		'熊本県',
					'44' =>		'大分県',
					'45' =>		'宮崎県',
					'46' =>		'鹿児島県',
					'47' =>		'沖縄県',
				);
				break;

			case 2:
				// 汎用　年		※現在年～設定年数分
				$ys = date("Y",DIFFERENCE_TIME);
				if ($op == '') { $op = 2; }
				$ye = $ys + $op;
				for($i=$ys; $i<=$ye; $i++) {
					$arr[$i] = $i;
				}
				break;

			case 3:
				// 汎用　年		※設定年～現在年
				$ye = date("Y",DIFFERENCE_TIME);
				if ($op == '') { $op = 2009; }
				for($i=$op; $i<=$ye; $i++) {
					$arr[$i] = $i;
				}
				break;

			case 4:
				// 生年月日（年）
				$ye = date("Y",DIFFERENCE_TIME);
				if ($op == '') { $op = 1900; }
				for($i=$op; $i<=$ye; $i++) {
					$arr[$i] = $i;
				}
				break;

			case 5:
				// 汎用　月
				for($i=1; $i<=12; $i++) {
					$arr[$i] = $i;
				//	$arr[$i] = sprintf("%02d", $i);
				}
				break;

			case 6:
				// 汎用　日
				for($i=1; $i<=31; $i++) {
					$arr[$i] = $i;
				//	$arr[$i] = sprintf("%02d",$i);
				}
				break;




			//-----------------------------------
			// 登録名簿
			case 20:
				// インデックス
				$arr = array(
					'1' =>		'あ',
					'2' =>		'か',
					'3' =>		'さ',
					'4' =>		'た',
					'5' =>		'な',
					'6' =>		'は',
					'7' =>		'ま',
					'8' =>		'や',
					'9' =>		'ら',
					'10' =>		'わ',
				);
				break;




			//-----------------------------------
			// システム管理	admin
			case 100:
				// ログインの有効
				$arr = array(
					'0' =>		'無効',
					'1' =>		'有効',
				);
				break;


			//-----------------------------------
			// 会員会社管理	company
			case 120:
				// 都道府県
				$arr = array(
					'24' =>		'三重県',
					'25' =>		'滋賀県',
					'26' =>		'京都府',
					'27' =>		'大阪府',
					'28' =>		'兵庫県',
					'29' =>		'奈良県',
					'30' =>		'和歌山県',
				);
				break;

			case 121:
				// 所属エリア
				$arr = array(
					'1' =>		'大阪市中央エリア',
					'2' =>		'大阪市北エリア',
					'3' =>		'大阪市西エリア',
					'4' =>		'大阪市南エリア',
					'5' =>		'大阪市東エリア',
					'6' =>		'大阪北部エリア',
					'7' =>		'大阪南部エリア',
					'8' =>		'大阪東部エリア',
					'9' =>		'京阪エリア',
					'10' =>		'阪神エリア',
					'11' =>		'神戸エリア',
					'12' =>		'兵庫西部エリア',
					'13' =>		'京都エリア',
					'14' =>		'滋賀エリア',
					'15' =>		'三重エリア',
					'16' =>		'奈良エリア',
					'17' =>		'和歌山エリア',
				);
				break;

			case 122:
				// 業種
				$arr = array(
					'1' =>		'事業用不動産の売買仲介',
					'2' =>		'事業用不動産の賃貸仲介',
					'3' =>		'居住用不動産の売買仲介',
					'4' =>		'居住用不動産の賃貸仲介',
					'5' =>		'不動産コンサルティング',
					'6' =>		'不動産鑑定',
					'7' =>		'不動産売買',
					'8' =>		'新築分譲',
					'9' =>		'不動産賃貸',
					'10' =>		'不動産管理',
				);
				break;

			case 123:
				// アクセスマップ
				$arr = array(
					'1' =>		'googleマップ',
					'2' =>		'オリジナル画像',
				);
				break;

			//-----------------------------------
			// 会員メンバー管理	member
			case 140:
				// 権限
				$arr = array(
					'0' =>		'一般',
					'1' =>		'管理者',
				);
				break;

			case 141:
				// キャリア１
				$arr = array(
					'1' =>		'docomo',
					'2' =>		'au',
					'3' =>		'softbank',
					'4' =>		'e-mobile',
					'5' =>		'willcom',
				);
				break;

			case 142:
				// キャリア２
				$arr = array(
					'1' =>		'docomo',
					'2' =>		'au',
					'3' =>		'softbank',
					'4' =>		'e-mobile',
					'5' =>		'willcom',
				);
				break;

			case 143:
				// 通知設定１
				$arr = array(
					'1' =>		'事務局からのお知らせ',
					'2' =>		'売りたい',
					'3' =>		'買いたい',
					'4' =>		'貸したい',
					'5' =>		'借りたい',
				);
				break;

			case 144:
				// 通知設定２
				$arr = array(
					'1' =>		'事務局からのお知らせ',
					'2' =>		'売りたい',
					'3' =>		'買いたい',
					'4' =>		'貸したい',
					'5' =>		'借りたい',
				);
				break;

			case 145:
				// 通知設定３
				$arr = array(
					'1' =>		'事務局からのお知らせ',
					'2' =>		'売りたい',
					'3' =>		'買いたい',
					'4' =>		'貸したい',
					'5' =>		'借りたい',
				);
				break;

			case 146:
				// ログインの有効
				$arr = array(
					'0' =>		'無効',
					'1' =>		'有効',
				);
				break;

			case 147:
				// 携帯1の表示
				$arr = array(
					'0' =>		'非表示',
					'1' =>		'表示',
				);
				break;

			case 148:
				// 携帯2の表示
				$arr = array(
					'0' =>		'非表示',
					'1' =>		'表示',
				);
				break;

			//-----------------------------------
			// ビジネスダイレクト管理	business_direct
			case 160:
				// 属性
				$arr = array(
					'1' =>		'売りたい',
					'2' =>		'買いたい',
					'3' =>		'貸したい',
					'4' =>		'借りたい',
				);
				break;

			case 161:
				// 記事種別
				$arr = array(
					'0' =>		'親記事',
					'1' =>		'追加記事',
				);
				break;

			//-----------------------------------
			// カテゴリ管理	category
			case 180:
				// 種別
				$arr = array(
					'0' =>		'親',
					'1' =>		'子',
				);
				break;






/*
			case 999:
				$arr = array(
				);
				break;
*/
			default:
				return '';
				break;
		}

		if ($key != '') {
			return $arr[$key];
		}
		return $arr;
	} // getMaster close

//--------------------------------------------
// 各案件毎の追加設定









} // OrgInitialExtends close

?>